/**
 * @copyright (C) COPYRIGHT 2022 Fortiortech Shenzhen
 * @file      main.c
 * @author    Fortiortech  Appliction Team
 * @since     Create:2023-07
 * @date      Last modify:2023-07
 * @note      Last modify author is Kobe Peng
 * @brief      
 */

#include <FU68xx_6.h>
#include <Myproject.h>

/*******************************************************************************
* Function Name  : EXTERN_Init
* Description    : P10
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void EXTI_Init(void)
{
    /*EXTI Input Pin 配置 ---------------------------------------- */
    ClrBit(P1_OE, P11);  						/* 0: Disable digital output */
    SetBit(P1_PU, P11);  						/* 0: Disable internal pull up */
      
    SetBit(P1_IE, P11);                     // P11作为外部中断口
    ClrBit(P1_IF, P11);                     // 清除P11外部中断
    /*-----------------------------------------------------------------------------------------------
    外部中断模式配置
    00: 上升沿产生中断  01: 下降沿产生中断  1x: 上升/下降沿产生中断
  -------------------------------------------------------------------------------------------------*/
    IT11 = 0;
    IT10 = 0;

    /*-------------------------------------------------------------------------------------------------
    外部中断优先级配置及芯片中断总使能
    PX01-PX00，中断优先级控制值从0-3依次表示优先级从最低到最高，共4级优化级控制
    EX0，外部中断0使能
    EA,芯片中断总使能
    外部中断是否有滤波的配置，决定于选择硬件保护触发信号源，外部中断0或者比较器3中断。
    若选择了比较器3中断，则外部中断无法进行滤波配置
    -------------------------------------------------------------------------------------------------*/
    SetBit(IP0, PX11);  //中断优先级设置为1，优先级低于FO硬件过流
    SetBit(IP0, PX10);

    EX1 = 1;								// 使能外部中断1, P11作为外部中断输入源

    IF0	 = 0;								// clear P00 interrupt flag
    EA = 1;									// 使能全局中断

}
